app/controllers/v1/greetings_controller.rb

    def index
      @message = Message.find(rand(1..5))
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]