app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def index
        @message = Message.find(rand(1..5))